{"Art and Crafts Foundation": "The Art and Crafts Foundation has brought creativity and expression to Malyadeva College.", "Mother Sri Lanka Programme": "The Mother Sri Lanka Programme at Maliyadeva College has empowered students to become agents of", "Students’ Counseling Unit": "The Students' Counseling Unit has provided important mental health services to Maliyadeva College", "Students’ Guidance Unit": "The Students' Guidance Unit has provided invaluable support to Maliyadeva College.", "Anatomic Society": "The Anatomic Society has brought a wealth of knowledge to Maliyadeva College.", "Drama Society": "The Drama Society has enriched Maliyadeva College with its creative performances.", "Oratory and Debating Society": "The Oratory and Debating Society has contributed greatly to enhancing the reputation of Maliyade", "Astronomical Society": "The Astronomical Society has brought greater scientific knowledge to Maliyadeva College.", "New Inventors Club": "The New Inventors Club has brought innovation and creativity to Maliyadeva College.", "Heritage Society": "The Heritage Society at Maliyadeva College has done great things to preserve the college's", "Environmental Brigade": "The Environmental Brigade Club has brought environmental awareness to Malyadeva College.", "Human Rights Circle": "Human Rights Circle has been actively promoting awareness and understanding of human rights at Maliyadeva", "Quiz Club": "The Quiz Club has brought an academic challenge to Maliyadeva College.", "Globe Society": "Globe Society has provided Malyadeva College students with a platform to explore global issues", "Unesco Society": "Unesco Society has promoted international understanding and collaboration within Maliyadeva College.", "Temperance Society": "The Temperance Society has been active in Maliyadeva College, promoting responsible drinking habits", "Traffic Control Unit": "The Traffic Control Unit at Maliyadeva College has successfully improved road safety and discipline.", "Olympiad Society": "The Olympiad Society has provided Maliyadeva College with a platform to excel in", "Drum Beating Team": "The Drum Beating Team has brought a unique energy and enthusiasm to Maliyadeva College", "Eastern Orchestra": "Eastern Orchestra has brought live music to Maliyadeva College with their enchanting performances.", "Western Orchestra": "The Western Orchestra Club has brought music and joy to Maliyadeva College.", "Media Unit": "The Media Unit club has enriched Malyadeva College with its creative activities.", "Student Parliament": "The Student Parliament club has contributed significantly to Maliyadeva College's growth and development.", "Peace Mission Circle": "Peace Mission Circle has provided leadership and service opportunities to Malyadeva College students.", "Biology Olympiad Society": "The Biology Olympiad Society has enriched Malyadeva College by providing students with a", "Philatelic Society": "The Philatelic Society has enriched Maliyadeva College by introducing students to the hobby", "Red Cross Society": "The Red Cross Society has contributed immensely to the development of Maliyadeva College.", "Photographic Society": "The Photographic Society at Maliyadeva College has enhanced students' creativity and skills.", "Commerce Society": "The Commerce Society has enriched Maliyadeva College with its various activities.", "Science Society": "The Science Society has promoted scientific knowledge and research within Maliyadeva College.", "Arts Society": "The Arts Society has enhanced the cultural diversity of Maliyadeva College.", "Young Readers Club": "Young Readers Club has enabled the students of Maliyadeva College to gain knowledge and broaden", "Disaster Management Society": "The Disaster Management Society has provided invaluable support to Maliyadeva College.", "Primary Eastern Band": "Maliyadeva College's Primary Eastern Band has provided an exciting platform for music and", "Primary Western Band": "The Primary Western Band has brought music and joy to Maliyadeva College.", "Kids Scouts Troop": "The Kids Scouts Troop at Maliyadeva College has empowered students with leadership and teamwork", "Cubs Scouts Troop": "The Cubs Scouts Troop has been a beneficial addition to Maliyadeva College, fostering", "Scouts Troop": "Scouts Troop has brought team-building, leadership and outdoor activities to Maliyade", "Buddhist Association": "The Buddhist Association has enhanced Maliyadeva College's spiritual atmosphere.", "Robotic Society": "The Robotic Society of Maliyadeva College has provided great opportunities for students to explore", "Social Science Society": "The Social Science Society has enriched Malyadeva College with stimulating activities and discussions.", "Chemistry Society": "The Chemistry Society of Maliyadeva College has promoted Chemistry education and research.", "Interact Club": "The Interact Club has brought together students of Maliyadeva College to promote community service", "St. Johns Ambulance Society": "The St. Johns Ambulance Society has provided first aid training to Maliyadeva", "Aqua Club": "The Aqua Club has promoted water conservation and awareness at Maliyadeva College.", "Energy Conservation Club": "Energy Conservation Club has worked to reduce electricity consumption in Maliyadeva College.", "School Conciliation Unit": "The School Conciliation Unit has provided a platform for students and staff to foster a more harmon", "Naval Cadet Platoon": "The Naval Cadet Platoon has brought invaluable experience to Maliyadeva College.", "Army Cadet Platoon": "The Army Cadet Platoon has enhanced the learning experience of Malyadeva College students", "Air Wing Boys Cadet Platoon": "Maliyadeva College's Air Wing Boys Cadet Platoon has provided innovative and", "Eastern Cadet Band": "Eastern Cadet Band has brought a vibrant atmosphere to Maliyadeva College with its energetic", "Western Cadet Band": "The Western Cadet Band has brought joy and a sense of pride to Maliyadeva", "Primary Prefects’ Board": "The Primary Prefects’ Board at Maliyadeva College has contributed to a", "Junior Prefects’ Board": "The Junior Prefects’ Board has contributed to Maliyadeva College's development", "Senior Prefects’ Board": "The Senior Prefects' Board of Maliyadeva College has encouraged student leadership and", "Aeronautical Club": "The Aeronautical Club at Maliyadeva College has fostered innovation and creativity in"}