{"Art and Crafts Foundation": "The Art and Crafts Foundation is a student-run club at Malyadeva College. It is a place for students to develop their creative and artistic talents through a variety of projects. The club's main focus is on creating and exploring the beauty of art and crafts. The club organizes workshops and seminars on various art and craft topics, such as drawing, painting, sculpture, weaving, jewelry making, and more. The club also provides guidance and assistance to students who are interested in", "Mother Sri Lanka Programme": "The Mother Sri Lanka Programme is a club at Maliyadeva College that aims to empower and create a better future for Sri Lankan mothers. The club strives to strengthen women's rights, health, and economic opportunities, while also providing support and resources for mothers. The club has been instrumental in improving the quality of education and health care for mothers in the college. It has helped organize workshops, seminars, and other activities to raise awareness about the issues that women face, while also promoting gender", "Students’ Counseling Unit": "The Students’ Counseling Unit at Maliyadeva College is a student-run organization dedicated to providing assistance and support to the student body. We provide free, confidential counseling services to all students, regardless of their background or situation, with the goal of promoting emotional wellbeing, mental health, and academic success. Our services include one-on-one counseling sessions, support groups, and educational workshops that cover topics such as stress management, coping with mental health challenges, and building healthy relationships", "Students’ Guidance Unit": "The Students’ Guidance Unit is a club at Maliyadeva College that works to promote the mental, physical, and social wellbeing of students. The club works with students to provide guidance and advice on how to best cope with stress, pressure, and other difficulties that they might face during their studies. The club also strives to create a safe and supportive environment for students to discuss any issues they might have. The club has organized various activities such as workshops, seminars, and talks to", "Anatomic Society": "The Anatomic Society at Maliyadeva College is a club dedicated to exploring the inner workings of the human body and the science of anatomy. Through various activities, the club members are able to gain knowledge and understanding of the structures and functions of the human body. Through lectures, seminars, and workshops, the club has been able to introduce students to the various aspects of anatomy and how it relates to their studies. The club has also been involved in organizing several outreach activities in the college,", "Drama Society": "The Drama Society at Maliyadeva College is a vibrant and enthusiastic club dedicated to the promotion of theatre and the performing arts. The society has been actively involved in the college since its inception in 2007, staging productions in both Sinhala and English, and hosting theatre workshops for students. Through the years, the society has strived to provide a platform for students to explore the creative potential of theatre, to build connections and to express themselves. The club has also been active in organizing fund", "Oratory and Debating Society": "The Oratory and Debating Society is a club at Maliyadeva College dedicated to fostering the art of public speaking and debate. We strive to develop our members’ confidence and ability to express themselves, think critically, and engage in meaningful dialogue. We offer a range of activities, including workshops, lectures, and debates. Through these activities, we strive to create an environment in which students can hone their skills and foster a passion for the craft. Our members have participated in a variety", "Astronomical Society": "The Astronomical Society at Maliyadeva College is an organization for students who are interested in astronomy, astrophysics, and space exploration. The Society provides members with the opportunity to increase their knowledge and understanding of the universe by attending lectures, attending star parties, and participating in stargazing activities. Members also have the opportunity to join in research projects and participate in field trips to nearby observatories. The Society has held lectures and workshops on a variety of topics, such as black holes,", "New Inventors Club": "The New Inventors Club at Maliyadeva College is a student-run organization committed to promoting innovation and creativity in the college community. We seek to create an environment where students can express their ideas, test their skills, and collaborate with peers to build new inventions. We provide a range of activities to foster creativity, including workshops, competitions, and hackathons. We also provide access to resources and mentors to help students develop their own inventions. Our club has had a positive impact", "Heritage Society": "The Heritage Society is a student-run club at Maliyadeva College that works to preserve and promote the college's cultural heritage. The club strives to bring together students from all backgrounds and cultures to celebrate the rich and diverse history of their college. The club has organized multiple events, such as heritage walks and mini-exhibitions, to educate and engage students in the college's heritage. Additionally, members of the club work to raise awareness of Maliyadeva College's cultural and", "Environmental Brigade": "The Environmental Brigade is a club at Maliyadeva College that is dedicated to preserving and protecting the environment. The club was founded in 2018 with the mission of raising environmental awareness and promoting sustainable practices. The club has organized numerous fundraisers, events, and initiatives to raise funds for environmental causes. Additionally, the club has spearheaded several environmental projects such as beach and river clean ups, tree planting, and recycling drives. The Environmental Brigade is an active part of the college, and its members continue", "Human Rights Circle": "The Human Rights Circle at Maliyadeva College is a student-run club that works to promote human rights and social justice. The club has organized several events and activities to promote awareness and education about human rights issues in the local community. The club has held events such as seminars, panel discussions, film screenings, and book clubs to engage the students in meaningful conversations on human rights. Additionally, the club has organized volunteer activities, such as helping out at refugee camps and distributing food to those", "Quiz Club": "The Quiz Club at Maliyadeva College is a student-run organization that encourages students to engage in academic activities and develop their critical thinking skills. The club organizes quizzes on a variety of topics, such as current affairs, sports, science, history, geography, and culture. The club also conducts competitions between the different faculties in the college to foster healthy competition and intellectual curiosity. The club has hosted several inter-college quiz competitions, which have enabled the college to gain wider", "Globe Society": "The Globe Society is a student-run organization at Malyadeva College committed to developing an awareness of global issues and cultures among its members. The society has organized various activities that promote global understanding and mutual respect among students of different nationalities. These activities include intercultural dialogues, international conferences, cultural exchanges, and global service initiatives. Through these activities, the Globe Society has helped to create a more inclusive and open-minded environment in Malyadeva College, and has successfully brought", "Unesco Society": "The Unesco Society at Maliyadeva College is a student-led club that is dedicated to raising awareness about global issues and promoting the values of peace, tolerance, and education. The club has organized various programs and initiatives that have had a positive impact on the college and its students. These include raising funds for global causes, organizing awareness campaigns about the Sustainable Development Goals, hosting lectures and workshops on topics related to global issues, and engaging with the local community to promote peace and understanding", "Temperance Society": "The Temperance Society at Maliyadeva College is a student-led organization dedicated to promoting a safe and healthy lifestyle among its members. The Society has implemented a wide range of activities and initiatives designed to raise awareness about the risks associated with alcohol and substance abuse. Through educational campaigns, engaging events, and informative seminars, the society has encouraged students to make responsible decisions and to live their lives free from damaging substances. The Society has also worked to support and fund local charities and organizations that advocate", "Traffic Control Unit": "The Traffic Control Unit at Malyadeva College is a club dedicated to helping ensure safe and efficient traffic flow on campus. The club was formed in order to improve the safety of vehicles entering and exiting the college. The club is mainly composed of students who volunteer their time to ensure the safety of the campus and its visitors. The club has implemented a series of initiatives to reduce traffic congestion on campus, such as the installation of traffic lights, the placement of speed bumps and the introduction of parking", "Olympiad Society": "The Olympiad Society of Maliyadeva College has been established to promote academic excellence and to provide a platform for students to compete in a variety of Olympiad competitions. The club is dedicated to giving students the opportunity to build their skills in critical thinking, problem solving, and collaboration. Through Olympiad competitions, the club has been able to provide students with an enriching learning experience and to motivate them to perform at their best. The club has also organized various events to spread", "Drum Beating Team": "The Drum Beating Team of Maliyadeva College is a group of students dedicated to learning and perfecting the art of drumming. The team has been active since 2010, and has been a part of many cultural and traditional events around the college. Through their performances, the team strives to showcase the drumming styles of Sri Lanka, while also introducing new and innovative rhythms and techniques. The team is also involved in teaching other students how to play the drums, and has successfully trained several", "Eastern Orchestra": "The Eastern Orchestra at Maliyadeva College is a club dedicated to exploring and performing classical Eastern music. The club has been running for over 10 years, and has been providing students with the opportunity to learn and experience Eastern music. The club has performed at college events, cultural festivals, and in community centers around the country. It has also been invited to perform at international events, such as the World Music Festival in New Delhi. The club has also been instrumental in promoting Eastern music among the", "Western Orchestra": "The Western Orchestra Club at Maliyadeva College is a vibrant and active student organization that seeks to promote and foster a love for music and the performing arts. The club is dedicated to the development of students’ musical skills and talents through regular practice and performance sessions. Over the years, the Western Orchestra Club has been instrumental in organizing and hosting a variety of events, such as concerts, recitals, and master classes. These events have had a positive impact on the college, helping to", "Media Unit": "The Media Unit at Maliyadeva College is a student-run club dedicated to exploring and utilizing the latest media tools and technologies for educational, creative, and informative purposes. The club provides students with the opportunity to explore and develop their skills in multimedia production such as video and audio editing, video production, photography, and web design. The Media Unit has been an integral part of the college's culture since its creation and has been instrumental in enhancing the quality of education at Maliyadeva", "Student Parliament": "The Student Parliament of Maliyadeva College is an organization that strives to empower students and create an inclusive and vibrant culture in the college. The Student Parliament has achieved a great deal in the past few years, from organizing collaborative events and campaigns to creating an open dialogue between the students and the college administration. The Student Parliament works to promote a sense of unity amongst the students and promote the college’s values of excellence, respect, and responsibility. The members of the Student Parliament also organize", "Peace Mission Circle": "The Peace Mission Circle is an accredited student organization at Maliyadeva College that was created to promote and facilitate peace initiatives within the college and the surrounding community. The club was founded on the idea that peace is essential for creating a better world. The club has organized several events and activities to encourage peace and understanding, such as a peace walk, a peace march, a peace rally, a peace forum, and a peace exhibition. The club has also hosted workshops on various topics related to peace", "Biology Olympiad Society": "The Biology Olympiad Society (BOS) is a student-run organization at Maliyadeva College that promotes the appreciation of biology and the development of scientific skills among students. BOS has been active since its inception, hosting a range of activities from lectures, laboratory sessions, and field trips to competitions and conferences. Through these activities, BOS has encouraged students to understand the fundamentals of biology and to apply scientific principles to solve real-world problems. BOS has also served as", "Philatelic Society": "The Philatelic Society at Maliyadeva College is a student-run organization dedicated to the appreciation and study of stamps and postal history. Our mission is to promote stamp collecting and philatelic research through educational activities and events. We organize regular field trips to notable philatelic museums and post offices, where members can explore the history and art of stamps. We also conduct seminars and workshops on stamp collecting, so members can learn more about the hobby. Additionally, we hold stamp auctions", "Red Cross Society": "The Red Cross Society at Maliyadeva College is an organization dedicated to alleviating suffering and promoting the welfare of individuals and communities. The organization has been active on campus for many years and has sponsored a variety of activities to benefit the college and its students. The club has organized numerous blood donation drives, provided emergency relief during natural disasters, and provided training in first aid and CPR. They have also coordinated relief efforts in the local community, and conducted awareness campaigns for issues such as HIV/", "Photographic Society": "The Photographic Society at Maliyadeva College is a student-run club dedicated to the exploration of all aspects of photography. The club offers members a chance to learn new skills, share their work, and collaborate with other like-minded individuals. In addition to providing club members with the opportunity to develop their skills, the Photographic Society also focuses on giving back to the community. The club has held photography exhibitions and workshops to help students learn the basics of photography and to give back to", "Commerce Society": "The Commerce Society of Maliyadeva College is a student-run organization dedicated to the promotion of knowledge and understanding of the fields of business, economics, and finance. It provides students with a platform to engage in debates, discussions, and projects relevant to these fields. The society has organized seminars, workshops, and lectures on topics such as economics, accounting, finance, and taxation, as well as business cases, debates, and presentations. It also provides a platform for students to network and", "Science Society": "The Science Society of Maliyadeva College is a student-run organization that is dedicated to promoting scientific knowledge and research among the students of the college. The club hosts a variety of activities such as lectures, seminars, competitions, and excursions throughout the year to foster a greater understanding of science among the student body. The Science Society also actively encourages and assists students to participate in national and international science competitions and events. Through its activities, the Science Society has helped to establish Maliyade", "Arts Society": "The Arts Society at Malyadeva College is a vibrant and active club that encourages students to appreciate and engage with the arts. The club organizes a variety of events and activities throughout the year, including art exhibitions, theatre performances, film screenings, music concerts, and much more. Through these events, the Arts Society aims to create a culture of appreciation for the arts and provide an opportunity for students to explore their creative side. Additionally, the club has raised funds for various causes, such", "Young Readers Club": "The Young Readers Club at Maliyadeva College is a group of enthusiastic students who are passionate about reading and discussing books. The club was formed to help introduce students to the world of reading and to encourage them to explore different books and genres. The club has been active in organizing book discussions, author talks, and other literary events. The club has also worked with the college library to introduce new books to the collection and to promote reading among students. By providing students with an opportunity to explore", "Disaster Management Society": "The Disaster Management Society at Maliyadeva College is dedicated to educating and empowering students to become informed and proactive about disaster preparedness. The club brings together students and faculty from a variety of backgrounds to discuss, debate, and plan for natural disasters and other emergency situations. Members learn about the importance of mitigation and response strategies, as well as how to create their own emergency plans. The club has organized numerous workshops and seminars to help students develop their knowledge and skills in emergency management. They have", "Primary Eastern Band": "The Primary Eastern Band at Maliyadeva College is a student-led organization dedicated to the preservation and development of Eastern music. The club was founded in 2016 and has since become a staple of the Maliyadeva College community. The club focuses on traditional Eastern music and instruments, including tabla, sitar, sarod, harmonium, and more. The band has played at various college events and functions, including cultural festivals, academic seminars, and award ceremonies. They have also", "Primary Western Band": "The Primary Western Band at Maliyadeva College is a student-run organization that promotes music appreciation and performance. The club provides a variety of opportunities for members to learn and improve their skills in playing western music, including guitar, bass, drums, and other instruments. The club also hosts performances and workshops at the college, giving students a chance to showcase their abilities in front of an audience. The club has also organized events such as music competitions and open mic nights, giving students a platform", "Kids Scouts Troop": "Maliyadeva College Kids Scouts Troop is a student-led organization that seeks to inspire and empower the youth of the college and the surrounding community. The troop provides a safe and fun environment for students to learn valuable life skills, develop leadership abilities, and practice teamwork. Through a variety of activities, including camping trips, field trips, service projects, and more, the troop helps students gain knowledge of the outdoors, gain confidence in their own abilities, and form lasting friendships. The", "Cubs Scouts Troop": "The Cubs Scouts Troop at Maliyadeva College is a club that aims to foster a sense of community and camaraderie among the students. This club encourages students to take on leadership roles, develop teamwork skills, and tackle challenges. The club has achieved much in its short time at Maliyadeva College, organising various activities such as nature hikes, camping trips, and team-building activities. The club has also held several public service projects, such as beach clean-ups", "Scouts Troop": "The Scouts Troop at Maliyadeva College is a dynamic and engaging student-led organization that encourages students to develop their leadership skills, build confidence and explore new opportunities. The Troop organizes a variety of activities throughout the year, including camping trips, service projects, fundraising events, and educational talks. It is a great way for students to learn new skills, build relationships, and grow as individuals. The Scouts Troop has also helped to foster a strong sense of community within the", "Buddhist Association": "The Buddhist Association at Maliyadeva College is an organization dedicated to promoting Buddhist culture and values among students, faculty, and staff. The group organizes activities such as lectures and meditation sessions, to promote a better understanding of the Buddhist religion and its teachings. In addition, the group has organized several fundraising events and activities, such as the Maliyadeva College Buddhism Festival, to support the college’s Buddhist studies department. The Buddhist Association also plays an important role in providing spiritual", "Robotic Society": "The Robotic Society of Maliyadeva College is a student-run club that is dedicated to the promotion of robotics and its related fields. It strives to bring together all students of robotics, engineering, and computer science to explore and share their knowledge and expertise in the field. The club has been active in the college for many years and has organized various activities such as competitions, seminars, workshops, and presentations to promote the understanding of robotics. It also organizes guest lectures and provides students", "Social Science Society": "The Social Science Society at Maliyadeva College is a club dedicated to promoting the study and appreciation of the social sciences among students. It provides a platform for students to learn and discuss topics related to the social sciences, such as politics, sociology, anthropology, economics, and psychology. The club also encourages students to explore and engage in activities related to the social sciences, such as debates, discussions, research, and field trips. Through these activities, the club hopes to foster a greater understanding", "Chemistry Society": "Maliyadeva College's Chemistry Society is a student-run organization committed to fostering an interest in the field of chemistry. The club helps students gain hands-on experience in the laboratory, explore the field of chemistry through lectures and discussions, and participate in competitions and events. The club also provides students with resources and support in the form of mentoring and guidance. The Chemistry Society has held multiple events throughout the year, such as “Chemistry Challenge” and “Chem", "Interact Club": "The Interact Club at Malyadeva College is an international service club that focuses on promoting global understanding and appreciation for different cultures. This club has been very active in the college, organizing several events such as cultural festivals, charity events, and social awareness campaigns. The club has also initiated various projects and activities, such as providing scholarships to underprivileged students, organizing awareness campaigns about various social issues, and donating books to local libraries. Through its activities, the club has been instrumental in", "St. Johns Ambulance Society": "The St. Johns Ambulance Society is a student-run club at Maliyadeva College in Sri Lanka. The club has been running for several years and has become an important part of the college community. The club is dedicated to providing first aid and medical assistance to students, faculty, and staff within the college. Members of the club are trained in basic first aid and CPR, as well as in the use of defibrillators. They are also responsible for providing medical assistance", "Aqua Club": "The Aqua Club at Maliyadeva College is a student-run organization dedicated to promoting the appreciation and conservation of aquatic life. Through providing educational activities and events, the Aqua Club strives to provide awareness of aquatic life and its importance to both students and the community. The club has organized a range of activities such as field trips to local aquariums and water parks, and lectures and workshops on aquatic conservation. The club has also organized beach clean-ups and fundraisers to support the marine conservation", "Energy Conservation Club": "The Energy Conservation Club at Malyadeva College is a student-run organization dedicated to promoting energy efficiency and sustainability within the college and throughout the local community. The club has been instrumental in helping the college reduce its energy consumption and carbon footprint, by organizing energy-saving initiatives such as energy audits, energy education workshops, and energy-saving competitions. The club also advocates for renewable energy production, and has successfully lobbied for the installation of solar panels on the college roof. In addition, the", "School Conciliation Unit": "The School Conciliation Unit is a club at Maliyadeva College dedicated to promoting peace, understanding, and compromise among students of all backgrounds. This club has worked to create a sense of community and understanding among all students in the college. They organize events such as discussion groups, cultural exchanges, and student forums to foster communication and understanding between diverse student groups. They also work to create a safe environment for students to discuss their differences, as well as to come to agreements and compromises. The", "Naval Cadet Platoon": "The Naval Cadet Platoon of Maliyadeva College is a club dedicated to instilling a sense of patriotism and national pride in its members. The club’s primary activities include organizing and participating in parades, drills, and other activities related to naval cadet training. The club also organizes lectures and seminars on naval topics, and conducts sports and cultural competitions. Through these activities, the club members are able to gain a better understanding of the naval service and its importance in", "Army Cadet Platoon": "The Army Cadet Platoon at Maliyadeva College is a student-led organization that aims to build character, promote leadership, and foster camaraderie among its members. The club has done a great deal to promote and support the college. It has conducted various activities such as charity work, environmental awareness campaigns, seminars, and workshops. The members of the club have also taken part in competitions and events hosted by the college. Furthermore, the Army Cadet Platoon has provided", "Air Wing Boys Cadet Platoon": "The Air Wing Boys Cadet Platoon is an official cadet platoon of the Sri Lanka Air Force that has been active at Maliyadeva College since 2010. The platoon is made up of 30 students from grades 6-13, and they are trained in basic air force skills such as drill, marching, and saluting, as well as learning about air force planes, aircrafts and military history. They have also taken part in several competitions, such as the National Inter School Air Wing", "Eastern Cadet Band": "The Eastern Cadet Band is a student-run organization at Maliyadeva College in Sri Lanka. The club was founded in 2002 with the goal of promoting music and culture among the school’s students. Over the years, the Eastern Cadet Band has become a major part of the school’s culture. It plays at school events, such as the annual Sports Day and Prize Giving ceremonies, and is often invited to perform at public places. The band also performs at major", "Western Cadet Band": "The Western Cadet Band is a club at Malyadeva College that provides students with an opportunity to hone their musical and performing arts skills. The members of the band are trained in Western musical instruments such as drums, bass, guitar, and keyboards, and learn how to play popular Western songs. The band has performed at many school events such as pep rallies, school festivals, and competitions, and have even performed at the national level. Through their performances, the band has brought newfound", "Primary Prefects’ Board": "The Primary Prefects’ Board at Maliyadeva College is a student-led organization dedicated to the betterment of the school community. The primary prefects are responsible for the day-to-day operations of the school, such as organizing assemblies, monitoring student behavior, and serving as a liaison between the student body and faculty. The board also oversees student-run clubs and activities, such as sports teams, debate clubs, and the student newspaper. They are also charged", "Junior Prefects’ Board": "The Junior Prefects’ Board of Malyadeva College is a student-led initiative which seeks to foster a spirit of leadership amongst the junior student body. The board consists of a group of selected prefects from the college’s junior section, ranging from year 8 to year 11. The board is responsible for ensuring order and discipline in the college, as well as organising student-led activities and initiatives.\n\nThe board has done a great deal to foster a", "Senior Prefects’ Board": "The Senior Prefects’ Board is a group of exceptional students from Maliyadeva College who have been appointed to leadership positions within the college. The group consists of the Head Prefect, the Deputy Prefects, and the Prefects of each house. The board is responsible for setting a positive example for the rest of the student body, maintaining discipline and order among the students, and upholding the school’s values and standards. The board has made a significant impact", "Aeronautical Club": "The Aeronautical Club at Maliyadeva College has made a huge impact on the college. It was founded with the purpose of providing students with an opportunity to explore the field of aeronautics and its related technologies. The club has organized several workshops and seminars to help students gain a better understanding of the various aspects of aeronautics. It has also conducted several excursions and field trips to various aeronautical sites around the country. The club has also played a vital"}