{
    "Athletics": "Athletics at Maliyadeva College involves a range of track and field events, fostering physical fitness, speed, and endurance. Students compete in sprints, long-distance running, high jump, discus throw, and more, showcasing their athletic prowess.",
    "Cricket": "Cricket is more than a sport at Maliyadeva College; it's a passion. The school's cricket team practices diligently, honing their batting, bowling, and fielding skills. They proudly represent the school in local and regional competitions.",
    "Rugby": "Rugby is a rugged and thrilling sport at Maliyadeva College. The school's rugby team exhibits strength, teamwork, and determination as they tackle, scrum, and score tries. The sport instills discipline and camaraderie among players.",
    "Basketball": "Basketball is all about precision and teamwork at Maliyadeva College. The school's basketball team dribbles, shoots, and defends with finesse, competing in various leagues and tournaments while promoting sportsmanship.",
    "Tennis": "Tennis enthusiasts at Maliyadeva College refine their skills on the court. The school's tennis players learn to serve aces, volley with finesse, and engage in exciting singles and doubles matches, promoting physical agility and focus.",
    "Table Tennis": "Table tennis is a fast-paced and engaging sport at Maliyadeva College. Students master their paddle skills, spin shots, and quick reflexes, participating in thrilling matches both recreationally and competitively.",
    "Swimming": "Swimming at Maliyadeva College is about mastering the art of staying afloat. The school's swimmers glide through the water with elegance and speed, competing in swim meets and building endurance.",
    "Volleyball": "Volleyball fosters teamwork and agility at Maliyadeva College. The school's volleyball team spikes, serves, and digs their way to victory, representing the school in inter-school tournaments.",
    "Karate": "Karate at Maliyadeva College is about discipline and self-defense. Students learn martial arts techniques, enhancing their physical fitness and self-confidence while promoting respect and control.",
    "Gymnastic": "Gymnastics showcases flexibility and grace at Maliyadeva College. Gymnasts perform breathtaking routines on various apparatus, perfecting their balance and strength while representing the school in gymnastics competitions.",
    "Carrom": "Carrom is a strategic and skillful board game enjoyed by students at Maliyadeva College. Players use finger flicks to pocket their pieces while aiming for victory in friendly tournaments.",
    "Scrabble": "Scrabble is a word game that challenges vocabulary and strategy at Maliyadeva College. Students create words on the board, competing in brainy matches that enhance their language skills.",
    "Chess": "Chess is a game of strategy and intellect at Maliyadeva College. Chess enthusiasts engage in cerebral battles, employing tactics and foresight to outmaneuver their opponents in chess tournaments.",
    "Football": "Football is a beloved sport that unites students at Maliyadeva College. The school's football team dribbles, passes, and scores goals, representing the school with passion and teamwork in local leagues.",
    "Wrestling": "Wrestling is a test of strength and technique at Maliyadeva College. Wrestlers grapple and pin their opponents, competing in wrestling competitions that demand physical prowess and skill.",
    "Air Rifle Shooting": "Air Rifle Shooting is a precision sport at Maliyadeva College. Students aim for the bullseye, developing concentration and marksmanship skills while competing in shooting competitions.",
    "Archery": "Archery is an ancient art and sport at Maliyadeva College. Archers draw their bows, take aim, and release their arrows with precision, participating in archery contests that demand focus and accuracy.",
    "Aerobic Gymnastic": "Aerobic gymnastics combines fitness and creativity at Maliyadeva College. Students choreograph dynamic routines, showcasing their athleticism and flair in competitions.",
    "Hockey": "Hockey is a fast-paced and dynamic sport at Maliyadeva College. The school's hockey team skates, passes, and scores goals on the field, representing the school with speed and skill in matches.",
    "Weight Lifting": "Weight lifting is a strength-building discipline at Maliyadeva College. Students train to lift heavy weights, competing in weightlifting events that test their power and determination.",
    "Roller Skating": "Roller skating is a fun and exhilarating activity at Maliyadeva College. Students glide around on wheels, enjoying recreational skating and occasionally participating in roller skating competitions.",
    "Taekwondo": "Taekwondo is a martial art that emphasizes kicking techniques and discipline at Maliyadeva College. Students learn self-defense skills while promoting respect and control in their practice.",
    "Baseball": "Baseball is an exciting sport enjoyed by students at Maliyadeva College. The school's baseball team practices hitting, pitching, and fielding, representing the school in friendly matches and competitions."
    }